# brew bundle dump
tap "caskroom/cask"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"

brew "coreutils"
brew "docker"
brew "git"
brew "openssl"
brew "imagemagick"
brew "libyaml"
brew "neovim"
brew "postgresql", restart_service: true
brew "pyenv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "scmpuff"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# Casks
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "keybase"
cask "slack"
cask "slate"
cask "tor-browser"
cask "vlc"
