# Essential terminal utilities
tap "homebrew/services"

brew "openssl"
brew "readline", link: true
brew "git"
brew "postgresql"
brew "redis"
brew "imagemagick"
brew "tmux"
brew "neovim"
brew "curl", args: ["with-openssl"]
brew "zsh"
brew "stow"
brew "gpg"
brew "pyenv"
brew "python"
brew "scmpuff"
brew "the_silver_searcher"
brew "universal-ctags"
brew "docker"
brew "wget"
brew "freetype"

# Essential Mac apps
tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"

cask "docker"
cask "skype"
cask "iterm2"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "gpg-suite"
cask "java"
cask "karabiner-elements"
cask "keybase"
cask "slack"
cask "slate"
cask "tor-browser"
cask "vlc"

# Ruby development
brew "rbenv"
brew "ruby-build"
brew "rbenv-default-gems"

# Node development
brew "yarn"
brew "node"
